## [administrative stack](https://my-first-env.app.spacelift.io/stack/administrative-stack/run/01HDKH8G70G9BQ9M8Q6CAKDPKE) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HDKFBCCHJDQ93BXWQX6JET4G] Planning changes with 0 custom hooks...
spacelift_stack.worker-pool: Refreshing state... [id=worker-pool]
spacelift_blueprint.cifrcloud: Refreshing state... [id=cifrcloud]
spacelift_stack.terraform-project: Refreshing state... [id=terraform-project]
spacelift_policy.check-instance-type: Refreshing state... [id=lets-make-sure-the-instance-type-is-t2-micro]
spacelift_stack.cloudformation-test: Refreshing state... [id=cloudformation-test]
spacelift_policy.trigger-run-from-pr: Refreshing state... [id=trigger-run-from-pr]
spacelift_policy.default-Login-policy: Refreshing state... [id=default-login-policy]
spacelift_mounted_file.public-key: Refreshing state... [id=stack/terraform-project/public-key]
spacelift_policy.slack: Refreshing state... [id=slack-integration]
spacelift_policy.discord: Refreshing state... [id=discord-integration]
spacelift_drift_detection.terraform-project-drift: Refreshing state... [id=terraform-project]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=379163426062]
spacelift_aws_integration.this: Refreshing state... [id=01H8F4AYGZ0ZXNHTX3W76S210C]
aws_iam_role.this: Refreshing state... [id=my_role]
aws_iam_role_policy_attachment.this: Refreshing state... [id=my_role-20230822172305303600000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_iam_role.this has been deleted
  - resource "aws_iam_role" "this" {
        id                    = "my_role"
      - name                  = "my_role" -> null
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # spacelift_aws_integration.this has been deleted
  - resource "spacelift_aws_integration" "this" {
      - id                             = "01H8F4AYGZ0ZXNHTX3W76S210C" -> null
        name                           = "my_role"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.spacelift_aws_integration_attachment_external_id.terraform-project will be read during apply
  # (config refers to values not yet known)
 <= data "spacelift_aws_integration_attachment_external_id" "terraform-project" {
      + assume_role_policy_statement = (known after apply)
      + external_id                  = (known after apply)
      + id                           = (known after apply)
      + integration_id               = (known after apply)
      + read                         = true
      + stack_id                     = "terraform-project"
      + write                        = true
    }

  # aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess"
      + role       = "my_role"
    }

  # spacelift_aws_integration.this will be created
  + resource "spacelift_aws_integration" "this" {
      + duration_seconds               = 900
      + generate_credentials_in_worker = false
      + id                             = (known after apply)
      + name                           = "my_role"
      + role_arn                       = "arn:aws:iam::379163426062:role/my_role"
      + space_id                       = (known after apply)
    }

  # spacelift_aws_integration_attachment.this will be created
  + resource "spacelift_aws_integration_attachment" "this" {
      + attachment_id  = (known after apply)
      + id             = (known after apply)
      + integration_id = (known after apply)
      + read           = true
      + stack_id       = "terraform-project"
      + write          = true
    }

  # spacelift_drift_detection.terraform-project-drift will be created
  + resource "spacelift_drift_detection" "terraform-project-drift" {
      + id        = (known after apply)
      + reconcile = true
      + schedule  = [
          + "*/15 * * * *",
        ]
      + stack_id  = "terraform-project"
      + timezone  = "America/New_York"
    }

  # spacelift_stack.cloudformation-test will be updated in-place
  ~ resource "spacelift_stack" "cloudformation-test" {
        id                               = "cloudformation-test"
        name                             = "cloudformation-test"
        # (25 unchanged attributes hidden)

      ~ cloudformation {
          ~ template_bucket     = "jubran-test-bucket" -> "s3://jubran-test-bucket/cloudformation-spacelift-stack/"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # spacelift_stack.terraform-project will be updated in-place
  ~ resource "spacelift_stack" "terraform-project" {
        id                               = "terraform-project"
        name                             = "terraform-project"
      + worker_pool_id                   = "01H123RBHVK3GAX2KSTFC5R5WP"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # spacelift_stack.worker-pool will be updated in-place
  ~ resource "spacelift_stack" "worker-pool" {
        id                               = "worker-pool"
        name                             = "worker-pool"
      + worker_pool_id                   = "01H123RBHVK3GAX2KSTFC5R5WP"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 3 to change, 0 to destroy.

[01HDKFBCCHJDQ93BXWQX6JET4G] Changes are GO
[01HDKFBCCHJDQ93BXWQX6JET4G] Uploading the list of managed resources...
[01HDKFBCCHJDQ93BXWQX6JET4G] Please be aware that the run changes calculation includes output changes.
[01HDKFBCCHJDQ93BXWQX6JET4G] Resource list upload is GO
[01HDKFBCCHJDQ93BXWQX6JET4G] Generating JSON representation of the plan...
[01HDKFBCCHJDQ93BXWQX6JET4G] JSON representation is GO
[01HDKFBCCHJDQ93BXWQX6JET4G] Loading custom plan policy inputs...
[01HDKFBCCHJDQ93BXWQX6JET4G] 0 custom plan policy inputs found
[01HDKFBCCHJDQ93BXWQX6JET4G] No plan policies to evaluate
```

</details>